# School of AI - São Paulo
# Aula 6 - Exploração de Dados
# Prof. Esp. Victor Venites     -     12/02/2019

## - Python + Pandas
## - Explorando as opções

In [4]:
import pandas as pd
# Para bases de dados(arquivos, csv, excel, txt, sql), edição
# , visualização, busca, ordenação, tabulação, separação, junção.
# Estrutura de Dados, e ter ferramentas para Análise de Dados
import numpy as np

## Series

In [5]:
# criando uma lista
dadosLista = [1, 3, 5, np.nan, 6, 8] # NAN = Nào é número
dadosLista

[1, 3, 5, nan, 6, 8]

In [7]:
# CREATE Serie
dadosSerie = pd.Series(dadosLista, list('AACDEF'))
# Função list pega uma String e separa os caracteres como indice
dadosSerie

A    1.0
A    3.0
C    5.0
D    NaN
E    6.0
F    8.0
dtype: float64

In [11]:
dadosSerie[["A", "F"]] # filtra de acordo com as condições desejadas

A    1.0
A    3.0
F    8.0
dtype: float64

In [12]:
# Ver informações
[dadosSerie.name, dadosSerie.shape, dadosSerie.index, dadosSerie.values]
# Nome, Tamanho, Indices, Valores

[None,
 (6,),
 Index(['A', 'A', 'C', 'D', 'E', 'F'], dtype='object'),
 array([ 1.,  3.,  5., nan,  6.,  8.])]

## CREATE TABLE - DataFrame

In [13]:
# Cria um DataFrame com os dados da série anterior
dadosTabela = pd.DataFrame(dadosSerie,
                           index=dadosSerie.index,
                           columns=list('A'))
dadosTabela

     A
A  1.0
A  3.0
C  5.0
D  NaN
E  6.0
F  8.0

In [14]:
# Adiciona uma Serie ao DataFrame anterior, com números aleatórios
dadosTabela['b'] = pd.Series(
    np.random.randn(
        dadosSerie.shape[0]),
    index=dadosTabela.index)
dadosTabela

     A         b
A  1.0  1.087656
A  3.0 -0.839587
C  5.0 -0.471056
D  NaN  0.669912
E  6.0 -1.019119
F  8.0 -1.255408

## O que houve acima?   /\
 - Consigo calcular algo?

In [15]:
dadosTabela.name = "Super_Tabela"
dadosTabela.name

'Super_Tabela'

## SELECT - Buscar dados

In [17]:
# Seleciona os valores a partir da lição com index=1 até index=5, pulando de 2 em e
dadosTabela[1:5:2] # É zero-based

     A         b
A  3.0 -0.839587
D  NaN  0.669912

In [18]:
# head -> para selecionar os valores a partir do começco da base
dadosTabela["b"].head(3) # Não é zero-based

A    1.087656
A   -0.839587
C   -0.471056
Name: b, dtype: float64

In [19]:
# tail -> para selecionar os valores a partir do final da base
dadosTabela["b"].tail(3) # Não é zero-based

D    0.669912
E   -1.019119
F   -1.255408
Name: b, dtype: float64

In [22]:
# Hipótese do aluno para apagar uma coluna e ver como resulta
dadosTabela2 = dadosTabela.drop (['b'], axis=1)
dadosTabela2

     A
A  1.0
A  3.0
C  5.0
D  NaN
E  6.0
F  8.0

In [24]:
# vemos que a tabela principal ficou intacta
dadosTabela

     A         b
A  1.0  1.087656
A  3.0 -0.839587
C  5.0 -0.471056
D  NaN  0.669912
E  6.0 -1.019119
F  8.0 -1.255408

In [26]:
# Copy, copia os dados para uma nova variável, não afetando a principal
dadosTabela3 = dadosTabela.copy()
# o comando inplace apaga com "commit"
dadosTabela3.drop (['C'], axis=0, inplace=True)
dadosTabela3

     A         b
A  1.0  1.087656
A  3.0 -0.839587
D  NaN  0.669912
E  6.0 -1.019119
F  8.0 -1.255408

## Renomear cabeçalho

In [32]:
dadosTabela3.rename(columns = {"b":"B"}, inplace=True)
dadosTabela3

     A         B
A  1.0  1.087656
A  3.0 -0.839587
D  NaN  0.669912
E  6.0 -1.019119
F  8.0 -1.255408

# Obrigado!